/*==============================================================================

	Copyright (C) 2006  All developers at http://sourceforge.net/projects/seq



	This program is free software; you can redistribute it and/or

	modify it under the terms of the GNU General Public License

	as published by the Free Software Foundation; either version 2

	of the License, or (at your option) any later version.



	This program is distributed in the hope that it will be useful,

	but WITHOUT ANY WARRANTY; without even the implied warranty of

	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the

	GNU General Public License for more details.



	You should have received a copy of the GNU General Public License

	along with this program; if not, write to the Free Software

	Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.



  ==============================================================================*/



#include <winsock2.h>

#include <stdio.h>

#include <stdlib.h>

#include <windows.h>

#include <time.h>

#include <sys/types.h>

#include <sys/timeb.h>

#include <string.h>

#include <tlhelp32.h>

#include <aclapi.h>

#include <vector>



//#define WRITE_STREAM 

//#define READ_STREAM



#define BYTES_TO_FLOAT(offset, buf, dst) (memcpy(&dst, (buf)+(offset), sizeof(float)))

#define BYTES_TO_INT(offset, buf, dst) (memcpy(&dst, (buf)+(offset), sizeof(int)))

#define BYTES_TO_BYTE(offset, buf, dst) (dst = (buf)[(offset)])


// Offsets in the spawninfo structure

int NameOffset = 0;

int XOffset = 0;

int YOffset = 0;

int ZOffset = 0;

int HeadingOffset = 0;

int SpeedOffset = 0;

int SpawnIDOffset = 0;

int TypeOffset = 0;

int ClassOffset = 0;

int RaceOffset = 0;

int LevelOffset = 0;

int HideOffset = 0;

int LastnameOffset = 0;

int NextOffset = 0;

int PrevOffset = 0;



int LargestSpawnOffset = 0;

char *spbuf;



int GINameOffset = 0;

int GIXOffset = 0;

int GIYOffset = 0;

int GIZOffset = 0;

int GISpawnIDOffset = 0;

int GINextOffset = 0;



int LargestItemOffset = 0;

char *gibuf;



char oldZone[128];



const int MAX_X_COORD = 1000000;

const int MIN_X_COORD = -1000000;

const int MAX_Y_COORD = 1000000;

const int MIN_Y_COORD = -1000000;

const int MAX_Z_COORD = 1000000;

const int MIN_Z_COORD = -1000000;

const int MAX_HEADING = 512;

const int MIN_HEADING = 0;

//TODO: check min and max values for runspeed

const int MAX_RUNSPEED = 1000000;

const int MIN_RUNSPEED = -1000000;



const int BUFFER_SIZE = 100000;



const int MAX_PROCESSES = 10;

DWORD maProcesses[MAX_PROCESSES];

int processCount=0;



//Bit Flags determining what data to send to the client

const int PACKET_TYPE_ZONE = 0x00000001;

const int PACKET_TYPE_PLAYER = 0x00000002;

const int PACKET_TYPE_TARGET = 0x00000004;

const int PACKET_TYPE_MOBS = 0x00000008;

const int PACKET_TYPE_GROUND_ITEMS = 0x00000010;

const int PACKET_TYPE_GET_PROCESSINFO = 0x00000020;

const int PACKET_TYPE_SET_PROCESSINFO = 0x00000040;



// Debug flags, constants and defines

const UINT DEBUG_WALK_TARGET  = 0x00001000; // Will attempt to walk spawnlist from pTarget

const UINT DEBUG_DUMP_SELF    = 0x00002000; // Display all self character data

const UINT DEBUG_WALK_DUMP    = 0x00004000; // Walk the spawnlist dumping offset values in given formats

const UINT DEBUG_MONITOR_TGTS = 0x00008000; // Monitor targets listed in the ini file

enum DebugWalkerFormat { DWF_NOTSET, DWF_BYTE, DWF_SHORT, DWF_DWORD, DWF_FLOAT, DWF_STRING };

#define DEBUG_MON_MAX           5			// Maximum number of allowable 'monitor' strings

#define DEBUG_MON_SIZE          50			// Maximum length of 'monitor' strings

#define DEBUG_READBUFSIZE		0x2000		// The size of the buffer to use in debug mode

#define DEBUG_WALK_MAX			1000		// Maximum number of spawns to walk



// Global flags to aid in debugging

bool gFirstPassDone = false;

UINT gDebugFlags = 0;

UINT gDebugSpawnCount=0;



// Debug test values (from ini file)

float Debug_XValue   = 0;

float Debug_YValue   = 0;

float Debug_ZValue   = 0;

int Debug_WalkFormat = 0;

int Debug_WalkOffset = 0;

int Debug_WalkIter   = 0;

int Debug_WalkSize   = 0;

int Debug_WalkLimit  = 0;

char Debug_MonMatch[DEBUG_MON_MAX][DEBUG_MON_SIZE];

char Debug_MonChange[DEBUG_MON_MAX][DEBUG_MON_SIZE];



// Prototypes

void DebugWalkTarget(UINT paddr, bool bForward);

void DebugDumpSelf(UINT paddr);

void DebugWalkSpawnsAndDump(UINT offset, DebugWalkerFormat format, UINT limit);

void DebugMonitorTargets(void);



#pragma pack(push, 1)

class SPAWNINFO_SEND {

public:

	SPAWNINFO_SEND()  {



	}

	SPAWNINFO_SEND(const SPAWNINFO_SEND &s)  {

		strncpy(Name, s.Name, 30);

		Y = s.Y;

		Z = s.Z;

		X = s.X;

		Heading  = s.Heading;

		SpeedRun = s.SpeedRun;

		SpawnID = s.SpawnID;

		Type = s.Type;

		Class = s.Class;

		Race = s.Race;

		Level = s.Level;

		Hide = s.Hide;

		strcpy(Lastname, s.Lastname);

		flags = s.flags;

	}



	SPAWNINFO_SEND &operator=(const SPAWNINFO_SEND &s)  {

		strncpy(Name, s.Name, 30);

		Y = s.Y;

		Z = s.Z;

		X = s.X;

		Heading  = s.Heading;

		SpeedRun = s.SpeedRun;

		SpawnID = s.SpawnID;

		Type = s.Type;

		Class = s.Class;

		Race = s.Race;

		Level = s.Level;

		Hide = s.Hide;

		strcpy(Lastname, s.Lastname);

		flags = s.flags;

		return *this;

	}

	CHAR Name[30];

	FLOAT Y;

	FLOAT X;

	FLOAT Z;

	FLOAT Heading;

	FLOAT SpeedRun;

	DWORD SpawnID;

	BYTE Type;							

	BYTE Class;

	DWORD Race;

	BYTE Level;

	BYTE Hide;

	CHAR Lastname[22];

	int flags;

} ;

#pragma pack(pop)



SPAWNINFO_SEND sisend;



/*typedef struct _GROUNDITEM {

struct _GROUNDITEM *pPrev;		// 0

struct _GROUNDITEM *pNext;		// 4

DWORD ID;						// 8

DWORD DropID;					// 12

DWORD Unknown;					// 16

DWORD DxID;						// 20

BYTE Unknown0024[176];			// 24

DWORD Unknown2;					// 200

FLOAT Heading;					// 204

FLOAT Z;						// 208

FLOAT X;						// 212

FLOAT Y;						// 216

CHAR Name[30];					// 220

int flags;						// 250

} GROUNDITEM, *PGROUNDITEM;

*/





bool CheckITEMtoSEND(SPAWNINFO_SEND *send)  {

	return 1;

	/*

	return ( strlen(send->Name)>0 &&

		send->X < MAX_X_COORD && send->X > MIN_X_COORD &&

		send->Y < MAX_Y_COORD && send->Y > MIN_Y_COORD &&

		send->Z < MAX_Z_COORD && send->Z > MIN_Z_COORD );

		*/

}



bool AssignITEMtoSEND(char *s, SPAWNINFO_SEND *send)  {

	BYTES_TO_STRING(GINameOffset, s, send->Name,30);

	BYTES_TO_INT(GIXOffset, s, send->X);

	BYTES_TO_INT(GIYOffset, s, send->Y);

	BYTES_TO_INT(GIZOffset, s, send->Z);

	BYTES_TO_INT(GISpawnIDOffset, s, send->SpawnID);



	// Sanity Check

	return CheckITEMtoSEND(send);

}

bool CheckSPAWNtoSEND(SPAWNINFO_SEND *send)  {

	return 1;

	/*return ( strlen(send->Name)>0 &&

		send->X < MAX_X_COORD && send->X > MIN_X_COORD &&

		send->Y < MAX_Y_COORD && send->Y > MIN_Y_COORD &&

		send->Z < MAX_Z_COORD && send->Z > MIN_Z_COORD &&

		send->Heading < MAX_HEADING && send->Heading > MIN_HEADING //&&

